// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'. 

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою  
// перетворіть значення на число за допомогою Number().

//const num = prompt("Enter number");
//num && Number(num) === 10 ? alert("Correct") : alert("Wrong");

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"


//const min = Math.floor(Math.random() * (59 - 0) + 0);

//function getQuater(min) {
//	if (min > 0 && min <= 15) {
//		return `${min} входить в першу чверть`;
//	} else if (min > 15 && min <= 30) {
//		return `${min} входить в другу чверть`;
//	} else if (min > 30 && min <= 45) {
//		return `${min} входить в третю чверть`;
//	} else if (min > 45 && min <= 60) {
//		return `${min} входить в четверту чверть`;
//	} else {
//		return "ERROR";
//	}
//}

//alert(getQuater(min));

// Змінна num може набувати 4 значення: '1', '2', '3' або '4' 
// (запитуй це значення у користувача через prompt). 
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач 
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

//=================================//

//const num = prompt("enter number");

//let result;

//switch (num) {
//	case "1":
//		result = "Winter";
//		break;
//	case "2":
//		result = "Spring";
//		break;
//	case "3":
//		result = "Summer";
//		break;
//	case "4":
//		result = "Outum";
//		break;
//	default:
//		result = "ERROR"
//}

//alert(result);


// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'): 
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples


//const num = prompt("enter number");

//const num = 135;

//let hours = Math.floor(num / 60);
//let minutes = num % 60;

//function leftFillNum(num, targetLength) {
//	return num.toString().padStart(targetLength, "0");
//}

//console.log(`${leftFillNum(hours, 2)} : ${leftFillNum(minutes, 2)}`);

//==========================================//

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

//let userName = prompt("логін");

//const pwdAdmin = "123";

//if (userName.trim() === "Admin") {
//	let password = prompt("password");
//	if (password.trim() === pwdAdmin) {
//		alert("Добрий день!");
//	} else { alert("Невірний пароль!"); }
//} else {
//	alert("Скасовано");
//}


//===================================//

// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

//let num = 0;

//while (num <= 20) {
//	console.log(num);
//	num++;
//}


//==================================7=========================//

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри - 
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

//const minX = 5;
//const maxX = 10;

//function getNumbers(min, max) {
//	let total = 0;
//	for (max; max >= min; max--) {
//		console.log(max);

//		if (max / 2 === Math.floor(max / 2)) {
//			total += max;
//		}
//	}

//	console.log("total", total);

//}

//getNumbers(minX, maxX);

//==================================8=========================//

// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

//const a = 0;
//const b = 17;

//console.log(isNaN(a) || isNaN(b) ? 'Not a number!' : Math.min(a, b));

//==================================9=========================//

// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true, 
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm 
// і повертає його результат (true/false).

//const age = 17;

//function isAdult(age) {

//	if (age < 18) {
//		return confirm("Your age 18!");
//	}

//}

//console.log(isAdult(14));


//==================================10=========================//

// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

function fizzBuzz(num) {
	let result = "";

	switch (num % 3) {
		case 0:
			result = 'fizz';
			break;
		default:
	}

	switch (num % 5) {
		case 0:
			result += 'buzz';
			break;
		default:
	}

	return result;
}

for (let index = 9; index <= 15; index++) {
	console.log(index, "-", fizzBuzz(index));

}